#include "cube.h"
#include "directx.h"
#include "shader.h"
#include "texture.h"
#include "camera.h"



static ID3D11Buffer* g_VertexBuffer; //頂点バッファ

static ID3D11Buffer* g_IndexBuffer; //インデックスバッファ


static const int g_IndexCount = 36; //インデックス数
static int g_Texture;

static XMFLOAT3 g_Position[441] =
{
	{0.0f,	0.0f,	0.0f},
	{1.0f,	0.0f,	0.0f},
	{2.0f,	0.0f,	0.0f},
	{3.0f,	0.0f,	0.0f},
	{4.0f,	0.0f,	0.0f},
	{5.0f,	0.0f,	0.0f},
	{6.0f,	0.0f,	0.0f},
	{7.0f,	0.0f,	0.0f},
	{8.0f,	0.0f,	0.0f},
	{9.0f,	0.0f,	0.0f},
	{10.0f,	0.0f,	0.0f},
	{-1.0f,	0.0f,	0.0f},
	{-2.0f,	0.0f,	0.0f},
	{-3.0f,	0.0f,	0.0f},
	{-4.0f,	0.0f,	0.0f},
	{-5.0f,	0.0f,	0.0f},
	{-6.0f,	0.0f,	0.0f},
	{-7.0f,	0.0f,	0.0f},
	{-8.0f,	0.0f,	0.0f},
	{-9.0f,	0.0f,	0.0f},
	{-10.0f,0.0f,	0.0f},

	{0.0f,	0.0f,	1.0f},
	{1.0f,	0.0f,	1.0f},
	{2.0f,	0.0f,	1.0f},
	{3.0f,	0.0f,	1.0f},
	{4.0f,	0.0f,	1.0f},
	{5.0f,	0.0f,	1.0f},
	{6.0f,	0.0f,	1.0f},
	{7.0f,	0.0f,	1.0f},
	{8.0f,	0.0f,	1.0f},
	{9.0f,	0.0f,	1.0f},
	{10.0f,	0.0f,	1.0f},
	{-1.0f,	0.0f,	1.0f},
	{-2.0f,	0.0f,	1.0f},
	{-3.0f,	0.0f,	1.0f},
	{-4.0f,	0.0f,	1.0f},
	{-5.0f,	0.0f,	1.0f},
	{-6.0f,	0.0f,	1.0f},
	{-7.0f,	0.0f,	1.0f},
	{-8.0f,	0.0f,	1.0f},
	{-9.0f,	0.0f,	1.0f},
	{-10.0f,0.0f,	1.0f},

	{0.0f,	0.0f,	2.0f},
	{1.0f,	0.0f,	2.0f},
	{2.0f,	0.0f,	2.0f},
	{3.0f,	0.0f,	2.0f},
	{4.0f,	0.0f,	2.0f},
	{5.0f,	0.0f,	2.0f},
	{6.0f,	0.0f,	2.0f},
	{7.0f,	0.0f,	2.0f},
	{8.0f,	0.0f,	2.0f},
	{9.0f,	0.0f,	2.0f},
	{10.0f,	0.0f,	2.0f},
	{-1.0f,	0.0f,	2.0f},
	{-2.0f,	0.0f,	2.0f},
	{-3.0f,	0.0f,	2.0f},
	{-4.0f,	0.0f,	2.0f},
	{-5.0f,	0.0f,	2.0f},
	{-6.0f,	0.0f,	2.0f},
	{-7.0f,	0.0f,	2.0f},
	{-8.0f,	0.0f,	2.0f},
	{-9.0f,	0.0f,	2.0f},
	{-10.0f,0.0f,	2.0f},

	{0.0f,	0.0f,	3.0f},
	{1.0f,	0.0f,	3.0f},
	{2.0f,	0.0f,	3.0f},
	{3.0f,	0.0f,	3.0f},
	{4.0f,	0.0f,	3.0f},
	{5.0f,	0.0f,	3.0f},
	{6.0f,	0.0f,	3.0f},
	{7.0f,	0.0f,	3.0f},
	{8.0f,	0.0f,	3.0f},
	{9.0f,	0.0f,	3.0f},
	{10.0f,	0.0f,	3.0f},
	{-1.0f,	0.0f,	3.0f},
	{-2.0f,	0.0f,	3.0f},
	{-3.0f,	0.0f,	3.0f},
	{-4.0f,	0.0f,	3.0f},
	{-5.0f,	0.0f,	3.0f},
	{-6.0f,	0.0f,	3.0f},
	{-7.0f,	0.0f,	3.0f},
	{-8.0f,	0.0f,	3.0f},
	{-9.0f,	0.0f,	3.0f},
	{-10.0f,0.0f,	3.0f},

	{0.0f,	0.0f,	4.0f},
	{1.0f,	0.0f,	4.0f},
	{2.0f,	0.0f,	4.0f},
	{3.0f,	0.0f,	4.0f},
	{4.0f,	0.0f,	4.0f},
	{5.0f,	0.0f,	4.0f},
	{6.0f,	0.0f,	4.0f},
	{7.0f,	0.0f,	4.0f},
	{8.0f,	0.0f,	4.0f},
	{9.0f,	0.0f,	4.0f},
	{10.0f,	0.0f,	4.0f},
	{-1.0f,	0.0f,	4.0f},
	{-2.0f,	0.0f,	4.0f},
	{-3.0f,	0.0f,	4.0f},
	{-4.0f,	0.0f,	4.0f},
	{-5.0f,	0.0f,	4.0f},
	{-6.0f,	0.0f,	4.0f},
	{-7.0f,	0.0f,	4.0f},
	{-8.0f,	0.0f,	4.0f},
	{-9.0f,	0.0f,	4.0f},
	{-10.0f,0.0f,	4.0f},

	{0.0f,	0.0f,	5.0f},
	{1.0f,	0.0f,	5.0f},
	{2.0f,	0.0f,	5.0f},
	{3.0f,	0.0f,	5.0f},
	{4.0f,	0.0f,	5.0f},
	{5.0f,	0.0f,	5.0f},
	{6.0f,	0.0f,	5.0f},
	{7.0f,	0.0f,	5.0f},
	{8.0f,	0.0f,	5.0f},
	{9.0f,	0.0f,	5.0f},
	{10.0f,	0.0f,	5.0f},
	{-1.0f,	0.0f,	5.0f},
	{-2.0f,	0.0f,	5.0f},
	{-3.0f,	0.0f,	5.0f},
	{-4.0f,	0.0f,	5.0f},
	{-5.0f,	0.0f,	5.0f},
	{-6.0f,	0.0f,	5.0f},
	{-7.0f,	0.0f,	5.0f},
	{-8.0f,	0.0f,	5.0f},
	{-9.0f,	0.0f,	5.0f},
	{-10.0f,0.0f,	5.0f},

	{ 0.0f,		0.0f,	6.0f },
	{ 1.0f,		0.0f,	6.0f },
	{ 2.0f,		0.0f,	6.0f },
	{ 3.0f,		0.0f,	6.0f },
	{ 4.0f,		0.0f,	6.0f },
	{ 5.0f,		0.0f,	6.0f },
	{ 6.0f,		0.0f,	6.0f },
	{ 8.0f,		0.0f,	6.0f },
	{ 7.0f,		0.0f,	6.0f },
	{ 9.0f,		0.0f,	6.0f },
	{ 10.0f,	0.0f,	6.0f },
	{ -1.0f,	0.0f,	6.0f },
	{ -2.0f,	0.0f,	6.0f },
	{ -3.0f,	0.0f,	6.0f },
	{ -4.0f,	0.0f,	6.0f },
	{ -5.0f,	0.0f,	6.0f },
	{ -6.0f,	0.0f,	6.0f },
	{ -7.0f,	0.0f,	6.0f },
	{ -8.0f,	0.0f,	6.0f },
	{ -9.0f,	0.0f,	6.0f },
	{ -10.0f,	0.0f,	6.0f },

	{ 0.0f,		0.0f,	7.0f },
	{ 1.0f,		0.0f,	7.0f },
	{ 2.0f,		0.0f,	7.0f },
	{ 3.0f,		0.0f,	7.0f },
	{ 4.0f,		0.0f,	7.0f },
	{ 5.0f,		0.0f,	7.0f },
	{ 6.0f,		0.0f,	7.0f },
	{ 8.0f,		0.0f,	7.0f },
	{ 7.0f,		0.0f,	7.0f },
	{ 9.0f,		0.0f,	7.0f },
	{ 10.0f,	0.0f,	7.0f },
	{ -1.0f,	0.0f,	7.0f },
	{ -2.0f,	0.0f,	7.0f },
	{ -3.0f,	0.0f,	7.0f },
	{ -4.0f,	0.0f,	7.0f },
	{ -5.0f,	0.0f,	7.0f },
	{ -6.0f,	0.0f,	7.0f },
	{ -7.0f,	0.0f,	7.0f },
	{ -8.0f,	0.0f,	7.0f },
	{ -9.0f,	0.0f,	7.0f },
	{ -10.0f,	0.0f,	7.0f },

	{ 0.0f,		0.0f,	8.0f },
	{ 1.0f,		0.0f,	8.0f },
	{ 2.0f,		0.0f,	8.0f },
	{ 3.0f,		0.0f,	8.0f },
	{ 4.0f,		0.0f,	8.0f },
	{ 5.0f,		0.0f,	8.0f },
	{ 6.0f,		0.0f,	8.0f },
	{ 8.0f,		0.0f,	8.0f },
	{ 7.0f,		0.0f,	8.0f },
	{ 9.0f,		0.0f,	8.0f },
	{ 10.0f,	0.0f,	8.0f },
	{ -1.0f,	0.0f,	8.0f },
	{ -2.0f,	0.0f,	8.0f },
	{ -3.0f,	0.0f,	8.0f },
	{ -4.0f,	0.0f,	8.0f },
	{ -5.0f,	0.0f,	8.0f },
	{ -6.0f,	0.0f,	8.0f },
	{ -7.0f,	0.0f,	8.0f },
	{ -8.0f,	0.0f,	8.0f },
	{ -9.0f,	0.0f,	8.0f },
	{ -10.0f,	0.0f,	8.0f },

	{ 0.0f,		0.0f,	9.0f },
	{ 1.0f,		0.0f,	9.0f },
	{ 2.0f,		0.0f,	9.0f },
	{ 3.0f,		0.0f,	9.0f },
	{ 4.0f,		0.0f,	9.0f },
	{ 5.0f,		0.0f,	9.0f },
	{ 6.0f,		0.0f,	9.0f },
	{ 8.0f,		0.0f,	9.0f },
	{ 7.0f,		0.0f,	9.0f },
	{ 9.0f,		0.0f,	9.0f },
	{ 10.0f,	0.0f,	9.0f },
	{ -1.0f,	0.0f,	9.0f },
	{ -2.0f,	0.0f,	9.0f },
	{ -3.0f,	0.0f,	9.0f },
	{ -4.0f,	0.0f,	9.0f },
	{ -5.0f,	0.0f,	9.0f },
	{ -6.0f,	0.0f,	9.0f },
	{ -7.0f,	0.0f,	9.0f },
	{ -8.0f,	0.0f,	9.0f },
	{ -9.0f,	0.0f,	9.0f },
	{ -10.0f,	0.0f,	9.0f },

	{ 0.0f,		0.0f,	10.0f },
	{ 1.0f,		0.0f,	10.0f },
	{ 2.0f,		0.0f,	10.0f },
	{ 3.0f,		0.0f,	10.0f },
	{ 4.0f,		0.0f,	10.0f },
	{ 5.0f,		0.0f,	10.0f },
	{ 6.0f,		0.0f,	10.0f },
	{ 8.0f,		0.0f,	10.0f },
	{ 7.0f,		0.0f,	10.0f },
	{ 9.0f,		0.0f,	10.0f },
	{ 10.0f,	0.0f,	10.0f },
	{ -1.0f,	0.0f,	10.0f },
	{ -2.0f,	0.0f,	10.0f },
	{ -3.0f,	0.0f,	10.0f },
	{ -4.0f,	0.0f,	10.0f },
	{ -5.0f,	0.0f,	10.0f },
	{ -6.0f,	0.0f,	10.0f },
	{ -7.0f,	0.0f,	10.0f },
	{ -8.0f,	0.0f,	10.0f },
	{ -9.0f,	0.0f,	10.0f },
	{ -10.0f,	0.0f,	10.0f },

	{ 0.0f,		0.0f,	11.0f },
	{ 1.0f,		0.0f,	11.0f },
	{ 2.0f,		0.0f,	11.0f },
	{ 3.0f,		0.0f,	11.0f },
	{ 4.0f,		0.0f,	11.0f },
	{ 5.0f,		0.0f,	11.0f },
	{ 6.0f,		0.0f,	11.0f },
	{ 8.0f,		0.0f,	11.0f },
	{ 7.0f,		0.0f,	11.0f },
	{ 9.0f,		0.0f,	11.0f },
	{ 10.0f,	0.0f,	11.0f },
	{ -1.0f,	0.0f,	11.0f },
	{ -2.0f,	0.0f,	11.0f },
	{ -3.0f,	0.0f,	11.0f },
	{ -4.0f,	0.0f,	11.0f },
	{ -5.0f,	0.0f,	11.0f },
	{ -6.0f,	0.0f,	11.0f },
	{ -7.0f,	0.0f,	11.0f },
	{ -8.0f,	0.0f,	11.0f },
	{ -9.0f,	0.0f,	11.0f },
	{ -10.0f,	0.0f,	11.0f },

	{ 0.0f,		0.0f,	12.0f },
	{ 1.0f,		0.0f,	12.0f },
	{ 2.0f,		0.0f,	12.0f },
	{ 3.0f,		0.0f,	12.0f },
	{ 4.0f,		0.0f,	12.0f },
	{ 5.0f,		0.0f,	12.0f },
	{ 6.0f,		0.0f,	12.0f },
	{ 8.0f,		0.0f,	12.0f },
	{ 7.0f,		0.0f,	12.0f },
	{ 9.0f,		0.0f,	12.0f },
	{ 10.0f,	0.0f,	12.0f },
	{ -1.0f,	0.0f,	12.0f },
	{ -2.0f,	0.0f,	12.0f },
	{ -3.0f,	0.0f,	12.0f },
	{ -4.0f,	0.0f,	12.0f },
	{ -5.0f,	0.0f,	12.0f },
	{ -6.0f,	0.0f,	12.0f },
	{ -7.0f,	0.0f,	12.0f },
	{ -8.0f,	0.0f,	12.0f },
	{ -9.0f,	0.0f,	12.0f },
	{ -10.0f,	0.0f,	12.0f },

	{ 0.0f,		0.0f,	13.0f },
	{ 1.0f,		0.0f,	13.0f },
	{ 2.0f,		0.0f,	13.0f },
	{ 3.0f,		0.0f,	13.0f },
	{ 4.0f,		0.0f,	13.0f },
	{ 5.0f,		0.0f,	13.0f },
	{ 6.0f,		0.0f,	13.0f },
	{ 8.0f,		0.0f,	13.0f },
	{ 7.0f,		0.0f,	13.0f },
	{ 9.0f,		0.0f,	13.0f },
	{ 10.0f,	0.0f,	13.0f },
	{ -1.0f,	0.0f,	13.0f },
	{ -2.0f,	0.0f,	13.0f },
	{ -3.0f,	0.0f,	13.0f },
	{ -4.0f,	0.0f,	13.0f },
	{ -5.0f,	0.0f,	13.0f },
	{ -6.0f,	0.0f,	13.0f },
	{ -7.0f,	0.0f,	13.0f },
	{ -8.0f,	0.0f,	13.0f },
	{ -9.0f,	0.0f,	13.0f },
	{ -10.0f,	0.0f,	13.0f },

	{ 0.0f,		0.0f,	14.0f },
	{ 1.0f,		0.0f,	14.0f },
	{ 2.0f,		0.0f,	14.0f },
	{ 3.0f,		0.0f,	14.0f },
	{ 4.0f,		0.0f,	14.0f },
	{ 5.0f,		0.0f,	14.0f },
	{ 6.0f,		0.0f,	14.0f },
	{ 8.0f,		0.0f,	14.0f },
	{ 7.0f,		0.0f,	14.0f },
	{ 9.0f,		0.0f,	14.0f },
	{ 10.0f,	0.0f,	14.0f },
	{ -1.0f,	0.0f,	14.0f },
	{ -2.0f,	0.0f,	14.0f },
	{ -3.0f,	0.0f,	14.0f },
	{ -4.0f,	0.0f,	14.0f },
	{ -5.0f,	0.0f,	14.0f },
	{ -6.0f,	0.0f,	14.0f },
	{ -7.0f,	0.0f,	14.0f },
	{ -8.0f,	0.0f,	14.0f },
	{ -9.0f,	0.0f,	14.0f },
	{ -10.0f,	0.0f,	14.0f },

	{ 0.0f,		0.0f,	15.0f },
	{ 1.0f,		0.0f,	15.0f },
	{ 2.0f,		0.0f,	15.0f },
	{ 3.0f,		0.0f,	15.0f },
	{ 4.0f,		0.0f,	15.0f },
	{ 5.0f,		0.0f,	15.0f },
	{ 6.0f,		0.0f,	15.0f },
	{ 8.0f,		0.0f,	15.0f },
	{ 7.0f,		0.0f,	15.0f },
	{ 9.0f,		0.0f,	15.0f },
	{ 10.0f,	0.0f,	15.0f },
	{ -1.0f,	0.0f,	15.0f },
	{ -2.0f,	0.0f,	15.0f },
	{ -3.0f,	0.0f,	15.0f },
	{ -4.0f,	0.0f,	15.0f },
	{ -5.0f,	0.0f,	15.0f },
	{ -6.0f,	0.0f,	15.0f },
	{ -7.0f,	0.0f,	15.0f },
	{ -8.0f,	0.0f,	15.0f },
	{ -9.0f,	0.0f,	15.0f },
	{ -10.0f,	0.0f,	15.0f },

	{ 0.0f,		0.0f,	16.0f },
	{ 1.0f,		0.0f,	16.0f },
	{ 2.0f,		0.0f,	16.0f },
	{ 3.0f,		0.0f,	16.0f },
	{ 4.0f,		0.0f,	16.0f },
	{ 5.0f,		0.0f,	16.0f },
	{ 6.0f,		0.0f,	16.0f },
	{ 8.0f,		0.0f,	16.0f },
	{ 7.0f,		0.0f,	16.0f },
	{ 9.0f,		0.0f,	16.0f },
	{ 10.0f,	0.0f,	16.0f },
	{ -1.0f,	0.0f,	16.0f },
	{ -2.0f,	0.0f,	16.0f },
	{ -3.0f,	0.0f,	16.0f },
	{ -4.0f,	0.0f,	16.0f },
	{ -5.0f,	0.0f,	16.0f },
	{ -6.0f,	0.0f,	16.0f },
	{ -7.0f,	0.0f,	16.0f },
	{ -8.0f,	0.0f,	16.0f },
	{ -9.0f,	0.0f,	16.0f },
	{ -10.0f,	0.0f,	16.0f },

	{ 0.0f,		0.0f,	17.0f },
	{ 1.0f,		0.0f,	17.0f },
	{ 2.0f,		0.0f,	17.0f },
	{ 3.0f,		0.0f,	17.0f },
	{ 4.0f,		0.0f,	17.0f },
	{ 5.0f,		0.0f,	17.0f },
	{ 6.0f,		0.0f,	17.0f },
	{ 8.0f,		0.0f,	17.0f },
	{ 7.0f,		0.0f,	17.0f },
	{ 9.0f,		0.0f,	17.0f },
	{ 10.0f,	0.0f,	17.0f },
	{ -1.0f,	0.0f,	17.0f },
	{ -2.0f,	0.0f,	17.0f },
	{ -3.0f,	0.0f,	17.0f },
	{ -4.0f,	0.0f,	17.0f },
	{ -5.0f,	0.0f,	17.0f },
	{ -6.0f,	0.0f,	17.0f },
	{ -7.0f,	0.0f,	17.0f },
	{ -8.0f,	0.0f,	17.0f },
	{ -9.0f,	0.0f,	17.0f },
	{ -10.0f,	0.0f,	17.0f },

	{ 0.0f,		0.0f,	18.0f },
	{ 1.0f,		0.0f,	18.0f },
	{ 2.0f,		0.0f,	18.0f },
	{ 3.0f,		0.0f,	18.0f },
	{ 4.0f,		0.0f,	18.0f },
	{ 5.0f,		0.0f,	18.0f },
	{ 6.0f,		0.0f,	18.0f },
	{ 8.0f,		0.0f,	18.0f },
	{ 7.0f,		0.0f,	18.0f },
	{ 9.0f,		0.0f,	18.0f },
	{ 10.0f,	0.0f,	18.0f },
	{ -1.0f,	0.0f,	18.0f },
	{ -2.0f,	0.0f,	18.0f },
	{ -3.0f,	0.0f,	18.0f },
	{ -4.0f,	0.0f,	18.0f },
	{ -5.0f,	0.0f,	18.0f },
	{ -6.0f,	0.0f,	18.0f },
	{ -7.0f,	0.0f,	18.0f },
	{ -8.0f,	0.0f,	18.0f },
	{ -9.0f,	0.0f,	18.0f },
	{ -10.0f,	0.0f,	18.0f },

	{ 0.0f,		0.0f,	19.0f },
	{ 1.0f,		0.0f,	19.0f },
	{ 2.0f,		0.0f,	19.0f },
	{ 3.0f,		0.0f,	19.0f },
	{ 4.0f,		0.0f,	19.0f },
	{ 5.0f,		0.0f,	19.0f },
	{ 6.0f,		0.0f,	19.0f },
	{ 8.0f,		0.0f,	19.0f },
	{ 7.0f,		0.0f,	19.0f },
	{ 9.0f,		0.0f,	19.0f },
	{ 10.0f,	0.0f,	19.0f },
	{ -1.0f,	0.0f,	19.0f },
	{ -2.0f,	0.0f,	19.0f },
	{ -3.0f,	0.0f,	19.0f },
	{ -4.0f,	0.0f,	19.0f },
	{ -5.0f,	0.0f,	19.0f },
	{ -6.0f,	0.0f,	19.0f },
	{ -7.0f,	0.0f,	19.0f },
	{ -8.0f,	0.0f,	19.0f },
	{ -9.0f,	0.0f,	19.0f },
	{ -10.0f,	0.0f,	19.0f },

	{ 0.0f,		0.0f,	20.0f },
	{ 1.0f,		0.0f,	20.0f },
	{ 2.0f,		0.0f,	20.0f },
	{ 3.0f,		0.0f,	20.0f },
	{ 4.0f,		0.0f,	20.0f },
	{ 5.0f,		0.0f,	20.0f },
	{ 6.0f,		0.0f,	20.0f },
	{ 8.0f,		0.0f,	20.0f },
	{ 7.0f,		0.0f,	20.0f },
	{ 9.0f,		0.0f,	20.0f },
	{ 10.0f,	0.0f,	20.0f },
	{ -1.0f,	0.0f,	20.0f },
	{ -2.0f,	0.0f,	20.0f },
	{ -3.0f,	0.0f,	20.0f },
	{ -4.0f,	0.0f,	20.0f },
	{ -5.0f,	0.0f,	20.0f },
	{ -6.0f,	0.0f,	20.0f },
	{ -7.0f,	0.0f,	20.0f },
	{ -8.0f,	0.0f,	20.0f },
	{ -9.0f,	0.0f,	20.0f },
	{ -10.0f,	0.0f,	20.0f },
};
static XMFLOAT3 g_Rotation;



void CubeInitialize(void)
{
	g_Texture = TextureLoad(L"asset\\texture\\tile.jpg");//テクスチャの読み込み
	g_Rotation = XMFLOAT3(0.0f, 0.0f, 0.0f);//回転初期化
	{
		//頂点バッファ生成
		D3D11_BUFFER_DESC bd{};
		bd.Usage = D3D11_USAGE_DYNAMIC; //バッファの使用法
		bd.ByteWidth = sizeof(Vertex) * 24; //頂点数
		bd.BindFlags = D3D11_BIND_VERTEX_BUFFER; //バッファのバインドフラグ
		bd.CPUAccessFlags = D3D11_CPU_ACCESS_WRITE; //CPUアクセスフラグ

		DirectXGetDevice()->CreateBuffer(&bd, NULL, &g_VertexBuffer); //バッファの生成
	}

	//頂点バッファの設定
	{
		D3D11_MAPPED_SUBRESOURCE msr;//頂点バッファにデータを設定
		DirectXGetDeviceContext()->Map(g_VertexBuffer, 0, D3D11_MAP_WRITE_DISCARD, 0, &msr); //バッファのマッピング

		Vertex* v = (Vertex*)msr.pData; //マッピングしたバッファのポインタを取得

		float width = 300.0f;
		float height = 300.0f;

		//上面
		v[0].position = { -0.5f	,0.5f	,0.5f }; //左上
		v[1].position = { 0.5f	,0.5f	,0.5f }; //右上
		v[2].position = { -0.5f	,0.5f	,-0.5f }; //左下
		v[3].position = { 0.5f	,0.5f	,-0.5f }; //右上
		//前面
		v[4].position = { -0.5f	,0.5f	,-0.5f }; //左上
		v[5].position = { 0.5f	,0.5f	,-0.5f }; //右上
		v[6].position = { -0.5f	,-0.5f	,-0.5f }; //左下
		v[7].position = { 0.5f	,-0.5f	,-0.5f }; //右上
		//右面
		v[8].position = { 0.5f	,0.5f	,-0.5f }; //左上
		v[9].position = { 0.5f	,0.5f	,0.5f }; //右上
		v[10].position = { 0.5f	,-0.5f	,-0.5f }; //左下
		v[11].position = { 0.5f	,-0.5f	,0.5f }; //右上
		//背面
		v[12].position = { 0.5f	,0.5f	,0.5f }; //左上
		v[13].position = { -0.5f	,0.5f	,0.5f }; //右上
		v[14].position = { 0.5f	,-0.5f	,0.5f }; //左下
		v[15].position = { -0.5f	,-0.5f	,0.5f }; //右上
		//左面
		v[16].position = { -0.5f	,0.5f	,0.5f }; //左上
		v[17].position = { -0.5f	,0.5f	,-0.5f }; //右上
		v[18].position = { -0.5f	,-0.5f	,0.5f }; //左下
		v[19].position = { -0.5f	,-0.5f	,-0.5f }; //右上
		//下面
		v[20].position = { -0.5f,-0.5f	,-0.5f }; //左上
		v[21].position = { 0.5f	,-0.5f	,-0.5f }; //右上
		v[22].position = { -0.5f,-0.5f	,0.5f }; //左下
		v[23].position = { 0.5f	,-0.5f	,0.5f }; //右上

		float tx = 0.0f;
		float ty = 0.0f;
		float tw = 1.0f;
		float th = 1.0f;

		//上面
		v[0].texcoord = { tx,		ty, }; //左上
		v[1].texcoord = { tx + tw,	ty, }; //右上
		v[2].texcoord = { tx,		ty +th, }; //左下
		v[3].texcoord = { tx + tw,	ty +th, }; //右上

		//前面
		v[4].texcoord = { tx,		ty, }; //左上
		v[5].texcoord = { tx + tw,	ty, }; //右上
		v[6].texcoord = { tx,		ty + th, }; //左下
		v[7].texcoord = { tx + tw,	ty + th, }; //右上

		//右面
		v[8].texcoord = { tx,		ty, }; //左上
		v[9].texcoord = { tx + tw,	ty, }; //右上
		v[10].texcoord = { tx,		ty + th, }; //左下
		v[11].texcoord = { tx + tw,	ty + th, }; //右上

		//背面
		v[12].texcoord = { tx,		ty, }; //左上
		v[13].texcoord = { tx + tw,	ty, }; //右上
		v[14].texcoord = { tx,		ty + th, }; //左下
		v[15].texcoord = { tx + tw,	ty + th, }; //右上
		//左面
		v[16].texcoord = { tx,		ty, }; //左上
		v[17].texcoord = { tx + tw,	ty, }; //右上
		v[18].texcoord = { tx,		ty + th, }; //左下
		v[19].texcoord = { tx + tw,	ty + th, }; //右上
		//下面
		v[20].texcoord = { tx,		ty, }; //左上
		v[21].texcoord = { tx + tw,	ty, }; //右上
		v[22].texcoord = { tx,		ty + th, }; //左下
		v[23].texcoord = { tx + tw,	ty + th, }; //右上
		DirectXGetDeviceContext()->Unmap(g_VertexBuffer, 0); //バッファのアンマッピング
	}

	//インデックスバッファ生成
	{
		D3D11_BUFFER_DESC bd{};
		bd.Usage = D3D11_USAGE_DYNAMIC; //バッファの使用法
		bd.ByteWidth = sizeof(unsigned int) * 36; //頂点数
		bd.BindFlags = D3D11_BIND_INDEX_BUFFER; //バッファのバインドフラグ
		bd.CPUAccessFlags = D3D11_CPU_ACCESS_WRITE; //CPUアクセスフラグ
		DirectXGetDevice()->CreateBuffer(&bd, NULL, &g_IndexBuffer); //バッファの生成
	}

	//インデックスバッファの設定
	{
		D3D11_MAPPED_SUBRESOURCE msr;
		DirectXGetDeviceContext()->Map(g_IndexBuffer, 0, D3D11_MAP_WRITE_DISCARD, 0, &msr);

		unsigned int* index = (unsigned int*)msr.pData;
		//上
		index[0]	= 0;
		index[1]	= 1;
		index[2]	= 2;

		index[3]	= 1;
		index[4]	= 3;
		index[5]	= 2;

		//前
		index[6]	= 4;
		index[7]	= 5;
		index[8]	= 6;

		index[9]	= 5;
		index[10]	= 7;
		index[11]	= 6;

		//右
		index[12]	= 8;
		index[13]	= 9;
		index[14]	= 10;

		index[15]	= 9;
		index[16]	= 11;
		index[17]	= 10;

		//後
		index[18]	= 12;
		index[19]	= 13;
		index[20]	= 14;

		index[21]	= 13;
		index[22]	= 15;
		index[23]	= 14;

		//左
		index[24]	= 16;
		index[25]	= 17;
		index[26]	= 18;

		index[27]	= 17;
		index[28]	= 19;
		index[29]	= 18;

		//下
		index[30]	= 20;
		index[31]	= 21;
		index[32]	= 22;

		index[33]	= 21;
		index[34]	= 23;
		index[35]	= 22;

		DirectXGetDeviceContext()->Unmap(g_VertexBuffer, 0); //バッファのアンマッピング
	}
}

void CubeFinalize(void)
{
	SAFE_RELEASE(g_VertexBuffer); //頂点バッファの解放
}

void CubeUpdate(void)
{
	g_Rotation.y += 0.00f;
}

//ポリゴン描画
void CubeDraw(void)
{
	//シェーダー設定
	Shader_Begin();
	//頂点バッファを設定
	UINT stride1 = sizeof(Vertex); //頂点のサイズ
	UINT offset = 0; //オフセット
	DirectXGetDeviceContext()->IASetVertexBuffers(0, 1, &g_VertexBuffer, &stride1, &offset);
	//インデックスバッファの設定
	DirectXGetDeviceContext()->IASetIndexBuffer(g_IndexBuffer, DXGI_FORMAT_R32_UINT, 0);
	//プリミティブトポロジーの設定
	DirectXGetDeviceContext()->IASetPrimitiveTopology(D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST); //トライアングルリスト
	//テクスチャ設定
	ID3D11ShaderResourceView* texture = GetTexture(g_Texture); //テクスチャの取得
	DirectXGetDeviceContext()->PSSetShaderResources(0, 1, &texture); //テクスチャの設定
	for (int a = 0, b = 0; a < 441; a++)
	{
		XMMATRIX matrix = XMMatrixIdentity(); //単位行列を作成
		matrix *= XMMatrixScaling(1.0f, 1.0f, 1.0f); //拡大縮小マトリクス
		matrix *= XMMatrixRotationRollPitchYaw(g_Rotation.x, g_Rotation.y, g_Rotation.z); //回転マトリクス
		matrix *= XMMatrixTranslation(g_Position[a].x, g_Position[a].y, g_Position[a].z); //移動マトリクス
		matrix *= GetCameraViewMatrix();//ビューマトリクス
		matrix *= GetCameraProjectionMatrix();//プロジェクションマトリクス
		Shader_SetMatrix(matrix);//シェーダーに行列を設定
		//ポリゴン描画
		DirectXGetDeviceContext()->DrawIndexed(g_IndexCount, 0, 0); //ポリゴンの描画 画数
	}
}

//トライアングルストリップ
//
//トライアングルリスト
//123 142 縮退三角形
// 
// リストとストリップはカリングのかかり方の処理に違いがある
// 
//インデックスバッファ
//012,
//132,
//234,
//軽い、早い、楽

